src/InformationRegisters/кфк_т_ТестовыйРегистр/кфк_т_ТестовыйРегистр.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфк_т_ТестовыйРегистр</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТестоваяСсылка</name>
    <type>
      <types>CatalogRef.кфк_т_ТестовыйСправочник</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Строка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Число</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИВремя</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/кфк_т_ТестовыйСправочник/кфк_т_ТестовыйСправочник.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфк_т_ТестовыйСправочник</name>
  <attributes>
    <name>ДатаИВремя</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Число</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Перечисление</name>
    <type>
      <types>EnumRef.кфк_т_ТестовоеПеречисление</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ДатаИВремя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Строка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/кфк_т_ТестовыйРегистр/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура СгенерироватьТестовыеДанные(Количество, РазмерСправочника) Экспорт
	
	ГСЗ = Обработки.кфк_т_ГенераторСлучайныхЗначений.Создать();
	
	ТекстЗапрос = "ВЫБРАТЬ ПЕРВЫЕ &Количество1 З.Ссылка 
	|	ИЗ (ВЫБРАТЬ ПЕРВЫЕ &Количество2 Справочник.кфк_т_ТестовыйСправочник.Ссылка УПОРЯДОЧИТЬ ПО Ссылка УБЫВ) КАК З
	|	УПОРЯДОЧИТЬ ПО Ссылка";
	ТекстЗапрос = СтрЗаменить(ТекстЗапрос, "&Количество1", XMLСтрока(Количество));
	ТекстЗапрос = СтрЗаменить(ТекстЗапрос, "&Количество2", XMLСтрока(ГСЗ.СлучайноеЧисло(Количество, РазмерСправочника)));
	Запрос = Новый Запрос(ТекстЗапрос);
	//@skip-check undefined-variable
	ТестовыйСправочник = кфкОбщегоНазначенияСлужебный.ВыбратьКолонку(Запрос.Выполнить().Выбрать(), "Ссылка");
	Если ТестовыйСправочник.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнен ''Тестовый справочник''!'");
	КонецЕсли;
	
	Набор = СоздатьНаборЗаписей();
	Для Номер = 1 По Количество Цикл
		
		НоваяСтрока = Набор.Добавить();
		НоваяСтрока.Период = ТекущаяДатаСеанса();
		НоваяСтрока.ТестоваяСсылка = ГСЗ.СлучайноеЗначениеИзСписка(ТестовыйСправочник);
		НоваяСтрока.Булево = ГСЗ.СлучайноеБулево();
		НоваяСтрока.Строка = ГСЗ.СлучайнаяСтрока(50);
		НоваяСтрока.Число = ГСЗ.СлучайноеЧисло(, , 4);
		НоваяСтрока.ДатаИВремя = ГСЗ.СлучайнаяДата();
		НоваяСтрока.Идентификатор = Новый УникальныйИдентификатор();
		НоваяСтрока.Комментарий = ГСЗ.СлучайнаяСтрока(256);
	
	КонецЦикла;
	
	Набор.ОбменДанными.Загрузка = Истина;
	Набор.ДополнительныеСвойства.Вставить("кфкПропуститьРегистрацию", Истина);
	Набор.Записать(РежимЗамещения.Добавление);
	
КонецПроцедуры

// Экспортируемая серверная функция, формирующая тело сообщения для отправки в Kafka.
// 
//  !!! ВНИМАНИЕ !!!
//  Если при регистрации регистра набор записей пуст, то:
//     * флаг ЭтоУдаление будет установлен в значение ДА;
//     * параметр Объект будет содержать значения полей, указанных в отборе.
// 
// Параметры:
//   Объект - Структура - запись регистра сведений, где ключи соответствуют полям регистра, включая 'ДополнительныеСвойства' набора записей.
//   Свойства - Структура - Дополнительные свойства сообщения:
//     * Продюсер - СправочникСсылка.кфкПродюсеры - Продюсер сообщения;
//     * ТипОбъект - Строка - Тип объекта, к которому относится сообщение;
//     * ТипИсходныхДанных - Строка - Тип исходных данных, к которому относится сообщение;
//     * СобытиеРегистрации - ПеречислениеСсылка.кфкСобытияРегистрации - Событие регистрации к обмену, см. кфкИнтеграция.ЭтоРегистрацияПриЗаписи, ЭтоРегистрацияПринудительно, ЭтоРегистрацияПрограммно;
//     * КлючРегистрации - Строка - Уникальный ключ регистрации;
//     * ДатаРегистрации - Дата - Дата регистрации события;
//     * ДатаРегистрацииМС - Число - Дата регистрации в миллисекундах;
//     * ПоследняяОбработка - Дата - Дата последней обработки сообщения;
//     * ЭтоУдаление - Булево - Флаг, указывающий, что регистрация была вызвана событием удаления;
//     * СсылкаНаОбъект - Неопределено, ЛюбаяСсылка - Ссылка на объект, к которому относится регистрация.
//   ТекстЖурнала - Строка - Текст журнала
//   Отказ - Булево - Признак отмены формирования и отправки сообщения.
// 
// Возвращаемое значение:
//   Неопределено, Структура - Описание сообщения, кфкИнтеграция.ПараметрыСообщения():
//     * Данные - Строка, ДвоичныеДанные, Структура - Тело сообщения
//     * Ключ - Строка - Уникальный идентификатор сообщения
//     * Заголовки - Соответствие Из Строка - Заголовки сообщения
//@skip-check doc-comment-type
//@skip-check doc-comment-ref-link
Функция Сериализация(Объект, Свойства, ТекстЖурнала, Отказ) Экспорт
	
	Результат = МодульКФК().ПараметрыСообщения();
	
	Данные = Новый Структура;
	Данные.Вставить("event", Объект.Период);
	Данные.Вставить("catalog", Объект.ТестоваяСсылка);
	Данные.Вставить("boolean", Объект.Булево);
	Данные.Вставить("string", Объект.Строка);
	Данные.Вставить("number", Объект.Число);
	Данные.Вставить("dateTime", Объект.ДатаИВремя);
	Данные.Вставить("uuid", Объект.Идентификатор);
	Данные.Вставить("comment", Объект.Комментарий);
	
	Результат.Данные = Данные;
	Результат.Заголовки.Вставить("ДатаСериализация", ТекущаяУниверсальнаяДата());
	
	Возврат Результат;

КонецФункции

// Экспортируемая серверная процедура, выполняющая обработку тела сообщения из Kafka.
// 
// Параметры:
//   ТелоСообщения - Строка, ДвоичныеДанные - Тело сообщения, передаваемое из брокера Kafka. Тип зависит от формата исходного сообщения.
//   Свойства - Структура - Дополнительные свойства сообщения:
//       * Консьюмер - СправочникСсылка.кфкКонсьюмеры - источник (консьюмер), получивший сообщение;
//       * Топик - Строка - Наименование топика
//       * Ключ - Строка - Ключ (идентификатор) сообщения, используемый для партиционирования;
//       * Раздел - Строка - Номер или имя раздела (partition);
//       * Смещение - Строка - Смещение (offset) сообщения в разделе;
//       * Заголовки - Соответствие Из Строка - Заголовки сообщения
//       * ДатаЗагрузки - Дата - Дата получения сообщения системой;
//       * ДатаОбработки - Дата - дата последней обработки сообщения.
//   ТекстЖурнала - Строка - Текст журнала.
//   Отказ - Булево - Признак отмены обработки сообщения.
//@skip-check doc-comment-type
Процедура Десериализация(ТелоСообщения, Свойства, ТекстЖурнала, Отказ) Экспорт
	
	Данные = ОбщегоНазначения.JSONВЗначение(ТелоСообщения, "event,dateTime", Ложь);
	
	Набор = СоздатьНаборЗаписей();
	
	НоваяСтрока = Набор.Добавить();
	НоваяСтрока.Период = Данные.event;
	НоваяСтрока.ТестоваяСсылка = ПолучитьСсылкуСправочника(Данные.catalog);
	НоваяСтрока.Булево = Данные.boolean;
	НоваяСтрока.Строка = Данные.string;
	НоваяСтрока.Число = Данные.number;
	НоваяСтрока.ДатаИВремя = Данные.dateTime;
	НоваяСтрока.Идентификатор = Новый УникальныйИдентификатор(Данные.uuid);
	НоваяСтрока.Комментарий = Данные.comment;
	
	Набор.Записать(РежимЗамещения.Слияние);
	
КонецПроцедуры

// Экспортируемая серверная функция, выполняющая выборку данных по заданным условиям запроса API.
// 
// Параметры:
//   ПараметрыЗапроса - Соответствие Из Произвольный - Кастомные параметры запроса.
//   Свойства - Структура - Дополнительные свойства:
//     * ИмяТопика - Строка - Имя топика;
//     * ТипОбъект - Строка - Тип объекта;
//   ТекстЖурнала - Строка - Текст ответа на запрос;
//   Отказ - Булево - Признак отмены запроса.
// 
// Возвращаемое значение:
//   Массив Из ЛюбаяСсылка, СправочникОбъект, ДокументОбъект, РегистрСведенийНаборЗаписей - Массив данных, подлежащих выгрузке через Kafka.
Функция ПодборДанных(ПараметрыЗапроса, Свойства, ТекстЖурнала, Отказ) Экспорт

	Результат = Новый Массив;
	
	Если ПараметрыЗапроса.Получить("all") = Истина Тогда
		
		Набор = СоздатьНаборЗаписей();
		Набор.Прочитать();
		Результат.Добавить(Набор);
		
	ИначеЕсли ПараметрыЗапроса.Получить("catalog") <> Неопределено Тогда
		Набор = СоздатьНаборЗаписей();
		Набор.Отбор.ТестоваяСсылка.Установить(ПолучитьСсылкуСправочника("catalog"));
		Набор.Прочитать();
		Если Набор.Количество() Тогда
			Результат.Добавить(Набор);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МодульКФК()
	
	//@skip-check bsl-legacy-check-string-literal
	Возврат ОбщегоНазначения.ОбщийМодуль("кфкИнтеграция");
	
КонецФункции

Функция ПолучитьСсылкуСправочника(Идентификатор)
	Возврат Справочники.кфк_т_ТестовыйСправочник.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));
КонецФункции

#КонецОбласти

#КонецЕсли
